In [ ]:
import pandas as pd
import numpy as np

df = pd.read_csv('/Users/dhruvbharara/Downloads/companies.csv')

In [ ]:
df

In [ ]:
def converted(Avg_salary):
    if isinstance(Avg_salary,str):
        if 'k' in Avg_salary:
            return float(Avg_salary.replace('k',''))*1000
        else:
            return (Avg_salary)
    else:
        return Avg_salary

In [ ]:
df['Avg_salary'] = df['Avg_salary'].apply(lambda x: converted(x))

In [22]:
df

,Company_name,Description,Ratings,Highly_rated_for,Critically_rated_for,Total_reviews,Avg_salary,Interviews_taken,Total_jobs_available,Total_benefits
0,TCS,IT Services & Consulting | 1 Lakh+ Employees |...,3.8,"Job Security, Work Life Balance","Promotions / Appraisal, Salary & Benefits",73.1k,856900.0,6.1k,847,11.5k
1,Accenture,IT Services & Consulting | 1 Lakh+ Employees |...,4.0,"Company Culture, Skill Development / Learning,...",NaN,46.4k,584600.0,4.3k,9.9k,7.1k
2,Cognizant,IT Services & Consulting | 1 Lakh+ Employees |...,3.9,Skill Development / Learning,Promotions / Appraisal,41.7k,561500.0,3.6k,460,5.8k
3,Wipro,IT Services & Consulting | 1 Lakh+ Employees |...,3.8,Job Security,"Promotions / Appraisal, Salary & Benefits",39.2k,427400.0,3.7k,405,5k
4,Capgemini,IT Services & Consulting | 1 Lakh+ Employees |...,3.9,"Job Security, Work Life Balance, Skill Develop...","Promotions / Appraisal, Salary & Benefits",34k,414400.0,2.8k,719,4k
...,...,...,...,...,...,...,...,...,...,...
9995,Techila Global Services,IT Services & Consulting | 501-1k Employees | ...,3.7,"Work Life Balance, Salary & Benefits, Company ...",NaN,72,454.0,2,26,21
9996,RxLogix Corporation,Pharma | 201-500 Employees | 14 years old | Pr...,2.6,"Work Life Balance, Work Satisfaction, Company ...",NaN,72,799.0,15,9,13
9997,Avians Innovations Technology,Building Material | 51-200 Employees | 17 year...,3.7,"Promotions / Appraisal, Work Satisfaction, Sal...",NaN,72,489.0,3,11,8
9998,ACPL Systems,Law Enforcement & Security | 51-200 Employees ...,3.3,"Promotions / Appraisal, Salary & Benefits, Wor...",NaN,72,520.0,4,1,10
9999,Beroe Inc,Management Consulting | 201-500 Employees | 19...,4.5,"Work Life Balance, Job Security, Company Culture",NaN,72,585.0,7,5,14

In [ ]:
df.Avg_salary.dtypes

In [21]:
df['Avg_salary'] = df['Avg_salary'].astype(float)

In [ ]:
df['Avg_salary'] = pd.to_numeric(df['Avg_salary'])

In [20]:
df['Avg_salary'] = df['Avg_salary'].replace('--',0)

In [28]:
filt1 = (df['Avg_salary'] > 350000)

In [30]:
df.loc[filt1,['Company_name','Avg_salary']]

  Company_name  Avg_salary
0          TCS    856900.0
1    Accenture    584600.0
2    Cognizant    561500.0
3        Wipro    427400.0
4    Capgemini    414400.0
7      Infosys    462000.0

In [34]:
df.columns

Index(['Company_name', 'Description', 'Ratings', 'Highly_rated_for',
       'Critically_rated_for', 'Total_reviews', 'Avg_salary',
       'Interviews_taken', 'Total_jobs_available', 'Total_benefits'],
      dtype='object')

In [35]:
def converted_interviews(Interviews_taken):
    if isinstance(Interviews_taken,str):
        if 'k' in Interviews_taken:
            return float(Interviews_taken.replace('k',''))*1000
        else:
            return Interviews_taken
    else:
        return Interviews_taken

In [38]:
df['Interviews_taken'] = df['Interviews_taken'].apply(lambda x: converted_interviews(x))

In [40]:
df.Interviews_taken

0       6100.0
1       4300.0
2       3600.0
3       3700.0
4       2800.0
         ...
9995         2
9996        15
9997         3
9998         4
9999         7
Name: Interviews_taken, Length: 10000, dtype: object

In [41]:
df['Interviews_taken'] = df['Interviews_taken'].replace('--',0)

In [43]:
df['Interviews_taken'] = df['Interviews_taken'].astype("float")

In [44]:
filt2 = (df['Interviews_taken']>1000)

In [46]:
df.loc[filt2,['Company_name','Interviews_taken']]

              Company_name  Interviews_taken
0                      TCS            6100.0
1                Accenture            4300.0
2                Cognizant            3600.0
3                    Wipro            3700.0
4                Capgemini            2800.0
5                HDFC Bank            1500.0
6               ICICI Bank            1900.0
7                  Infosys            4800.0
8                  HCLTech            2500.0
9            Tech Mahindra            2400.0
10                 Genpact            1900.0
11               Axis Bank            1100.0
12         Teleperformance            1300.0
13  Concentrix Corporation            1100.0
14                     Jio            1200.0
15                  Amazon            3400.0
16                     IBM            1500.0
17         Reliance Retail            1100.0
21                  BYJU'S            1800.0
23                Deloitte            1600.0

In [50]:
def converted_reviews(Total_reviews):
    if isinstance(Total_reviews,str):
        if 'k' in Total_reviews:
            return float(Total_reviews.replace('k', ''))*1000
        else:
            return Total_reviews
    else:
        return Total_reviews

In [51]:
df['Total_reviews'] = df['Total_reviews'].apply(lambda x: converted_reviews(x))

In [52]:
df.Total_reviews

0       73100.0
1       46400.0
2       41700.0
3       39200.0
4       34000.0
         ...
9995         72
9996         72
9997         72
9998         72
9999         72
Name: Total_reviews, Length: 10000, dtype: object

In [53]:
df['Total_reviews'] = df['Total_reviews'].replace('--',0)

In [54]:
df['Total_reviews'] = df['Total_reviews'].astype(float)

In [55]:
filt3 = (df['Total_reviews'] > 20000)

In [56]:
df.loc[filt3,['Company_name','Total_reviews']]

              Company_name  Total_reviews
0                      TCS        73100.0
1                Accenture        46400.0
2                Cognizant        41700.0
3                    Wipro        39200.0
4                Capgemini        34000.0
5                HDFC Bank        33900.0
6               ICICI Bank        33500.0
7                  Infosys        31800.0
8                  HCLTech        28500.0
9            Tech Mahindra        27600.0
10                 Genpact        26200.0
11               Axis Bank        22000.0
12         Teleperformance        21900.0
13  Concentrix Corporation        21800.0
14                     Jio        20600.0
15                  Amazon        20400.0